{
  "layout": "layouts/jointts/job-listing",
  "permalink": "/join/{{ title | slugify }}.html",
  "tags": "jobs",
  "title": "TTS IT Specialist",
  "opens": "2024-10-31T00:00:00.000Z",
  "closes": "2024-11-03T00:00:00.000Z",
  "external_url": null,
  "status_alert": true,
  "alert_keywords": null,
  "updated": null,
  "info_intro": "Open to U.S. citizens or nationals (residents of American Samoa and Swains Island). Subject to background check.",
  "supervisory_status": "non-supervisory",
  "usajobs_official_title": "IT Specialist",
  "vacancies": "Multiple",
  "location": "Anywhere in the U.S. (remote)",
  "gs": 13,
  "min_payrange": "$117,962",
  "max_payrange": "$153,354",
  "travel_requirement": "Occasional travel may be required up to 10%-20% per year.",
  "work_schedule": "Full time.",
  "max_applications": 500,
  "appointment_type": "term-limited",
  "key_objectives": [
    {
      "title": "IT Expert",
      "items": [
        "Engages with customer agencies, the public, and/or GSA management and staff to support/contribute to needs analyses to define opportunities for a new or improved business processes, solutions, practices, products, services or strategies based on customer/user needs.",
        "Works with stakeholders to develop project scopes and approach, to include such functions as determining the appropriate resources (e.g., financial, personnel, IT Solutions) and monitoring solution development and performance.",
        "Contributes to or conducts feasibility studies and trade-off analyses of/for IT projects, initiatives, and solutions to a variety of problems; prepares materials for business cases for the application of IT or modified products or services."
      ]
    },
    {
      "title": "Cross-functional Product/Service Delivery team functions",
      "items": [
        "Applies iterative development methodologies to specific products to meet different delivery needs. Contributes to the design, development, and deployment of IT solutions leveraging current and emergent IT solutions and best practices.",
        "Promotes transparency and maintains open lines of communication in how decisions are made to facilitate soundness of decision-making and responsiveness to issues, problems, and needs of teams, customers, and other stakeholders."
      ]
    },
    {
      "title": "IT Project Leadership",
      "items": [
        "Provide expert technical advice during IT projects.",
        "Reviews projects for technical feasibility and adherence with the organization's mission objectives and provides recommendations to the team and management prior to commencement of IT projects."
      ]
    },
    {
      "title": "Relationship Management",
      "items": [
        "Serves as a liaison establishing and maintaining mutual understanding and cooperation with program personnel within the agency to convey information regarding IT program activities, guidelines, goals, and clarifies procedures, interpret guidelines as needed.",
        "Presents highly technical information to a wide variety of audiences and documents processes and procedures information presentation for use in post hoc reviews, future activities, and similar purposes."
      ]
    }
  ],
  "info_sessions": [
    {
      "link": "https://events.zoomgov.com/ev/ApHdaoDfDk7vEPBDjo38kHFgRZVgNT1hP8JoTVG4fbRxDsQhSYOB~Ap1qv-G1U12zzM0ajvI_o0KqMp7n-4B7RQ2VljM-evCEXv81BVq5MJ4MnsipLu8ZysLQuaHyo_x7p8ZTjCo3taLVng",
      "date": "2024-10-29T00:00:00.000Z",
      "time": "4:00pm-5:00pm"
    }
  ],
  "role_summary": "Several business units within TTS are hiring for this role including cloud.gov, FedRAMP, Login.gov, and the Integrated Award Environment (IAE). This is an opportunity to make a huge difference in the lives of the public and other federal agencies. This page contains a high-level summary of the roles we are trying to fill. Our ideal candidates will be equally excited about sticky technical issues and intricate human ones. The strongest candidates will have a background working on cross-functional, multidisciplinary teams that deliver digital products and services in an incremental, user-focused environment. If you are interested in any or all of these roles, you should apply. You may be matched with multiple teams across TTS during the interview process based on your skills, experience, and interests.\n",
  "qualifications": "BASIC REQUIREMENTS: Have IT-related experience demonstrating EACH of the four competencies listed below:\nAttention to Detail - This skill is generally demonstrated by assignments where the applicant ensures that activities, services, or products reflect organizational goals and objectives.\nCustomer Service - This skill is generally demonstrated by assignments where the applicant confers with users to evaluate the effectiveness of, or identify the need for, computer programs or management systems.\nOral Communication - This skill is generally demonstrated by assignments where the applicant participates or represents the organization or clients at briefings, meetings, or conferences.\nProblem Solving - This skill is generally demonstrated by assignments where the applicant evaluates the efficiency or effectiveness of organizational programs, projects, or operations.\n",
  "specialized_requirements": "GS-13 LEVEL SPECIALIZED EXPERIENCE REQUIREMENTS: In addition to the Basic Requirements listed above, you must have one year of specialized experience equivalent to the GS-12 level in the Federal service.  Specialized experience is defined as experience:\nWorking with the design, roadmap, or technical implementation for a project, product, platform, or services.\nBuilding relationships or alignment with stakeholders.\nCoordinating or implementing findings in support of a project, product, platform or service.\nCollaborating with technical teams in support of a project, product, platform or service.\n",
  "application_link": "https://www.usajobs.gov/job/816604300"
}